[{"content":{"abstract":"Medical terminologies resources and standards play vital roles in clinical data exchanges, enabling significantly the services’ interoperability within healthcare national information networks. Health and medical science are constantly evolving causing requirements to advance the terminologies editions. In this paper, we present our evaluation work of the latest machine translation techniques addressing medical terminologies. Experiments have been conducted leveraging selected statistical and neural machine translation methods. The devised procedure is tested on a validated sample of ICD-11 and ICF terminologies from English to French with promising results.","authors":["Konstantinos Skianis","Yann Briand","Florent Desgrippes"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.7","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Evaluation of Machine Translation Methods applied to Medical Terminologies","tldr":"Medical terminologies resources and standards play vital roles in clinical data exchanges, enabling significantly the services’ interoperability within healthcare national information networks. Health and medical science are constantly evolving causi...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.12","presentation_id":"38940042","rocketchat_channel":"paper-louhi2020-12","speakers":"Konstantinos Skianis|Yann Briand|Florent Desgrippes","title":"Evaluation of Machine Translation Methods applied to Medical Terminologies"},{"content":{"abstract":"We present an in-depth comparison of three clinical information extraction (IE) systems designed to perform entity recognition and negation detection on brain imaging reports: EdIE-R, a bespoke rule-based system, and two neural network models, EdIE-BiLSTM and EdIE-BERT, both multi-task learning models with a BiLSTM and BERT encoder respectively. We compare our models both on an in-sample and an out-of-sample dataset containing mentions of stroke findings and draw on our error analysis to suggest improvements for effective annotation when building clinical NLP models for a new domain. Our analysis finds that our rule-based system outperforms the neural models on both datasets and seems to generalise to the out-of-sample dataset. On the other hand, the neural models do not generalise negation to the out-of-sample dataset, despite metrics on the in-sample dataset suggesting otherwise.","authors":["Andreas Grivas","Beatrice Alex","Claire Grover","Richard Tobin","William Whiteley"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.4","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Not a cute stroke: Analysis of Rule- and Neural Network-based Information Extraction Systems for Brain Radiology Reports","tldr":"We present an in-depth comparison of three clinical information extraction (IE) systems designed to perform entity recognition and negation detection on brain imaging reports: EdIE-R, a bespoke rule-based system, and two neural network models, EdIE-B...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.13","presentation_id":"38940043","rocketchat_channel":"paper-louhi2020-13","speakers":"Andreas Grivas|Beatrice Alex|Claire Grover|Richard Tobin|William Whiteley","title":"Not a cute stroke: Analysis of Rule- and Neural Network-based Information Extraction Systems for Brain Radiology Reports"},{"content":{"abstract":"Biomedical event extraction from natural text is a challenging task as it searches for complex and often nested structures describing specific relationships between multiple molecular entities, such as genes, proteins, or cellular components. It usually is implemented by a complex pipeline of individual tools to solve the different relation extraction subtasks. We present an alternative approach where the detection of relationships between entities is described uniformly as questions, which are iteratively answered by a question answering (QA) system based on the domain-specific language model SciBERT. This model outperforms two strong baselines in two biomedical event extraction corpora in a Knowledge Base Population setting, and also achieves competitive performance in BioNLP challenge evaluation settings.","authors":["Xing David Wang","Leon Weber","Ulf Leser"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.10","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Biomedical Event Extraction as Multi-turn Question Answering","tldr":"Biomedical event extraction from natural text is a challenging task as it searches for complex and often nested structures describing specific relationships between multiple molecular entities, such as genes, proteins, or cellular components. It usua...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.14","presentation_id":"38940044","rocketchat_channel":"paper-louhi2020-14","speakers":"Xing David Wang|Leon Weber|Ulf Leser","title":"Biomedical Event Extraction as Multi-turn Question Answering"},{"content":{"abstract":"The lack of publicly accessible text corpora is a major obstacle for progress in natural language processing. For medical applications, unfortunately, all language communities other than English are low-resourced. In this work, we present GGPONC (German Guideline Program in Oncology NLP Corpus), a freely dis tributable German language corpus based on clinical practice guidelines for oncology. This corpus is one of the largest ever built from German medical documents. Unlike clinical documents, clinical guidelines do not contain any patient-related information and can therefore be used without data protection restrictions. Moreover, GGPONC is the first corpus for the German language covering diverse conditions in a large medical subfield and provides a variety of metadata, such as literature references and evidence levels. By applying and evaluating existing medical information extraction pipelines for German text, we are able to draw comparisons for the use of medical language to other corpora, medical and non-medical ones.","authors":["Florian Borchert","Christina Lohr","Luise Modersohn","Thomas Langer","Markus Follmann","Jan Philipp Sachs","Udo Hahn","Matthieu-P. Schapranow"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.5","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"GGPONC: A Corpus of German Medical Text with Rich Metadata Based on Clinical Practice Guidelines","tldr":"The lack of publicly accessible text corpora is a major obstacle for progress in natural language processing. For medical applications, unfortunately, all language communities other than English are low-resourced. In this work, we present GGPONC (Ger...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.15","presentation_id":"38940045","rocketchat_channel":"paper-louhi2020-15","speakers":"Florian Borchert|Christina Lohr|Luise Modersohn|Thomas Langer|Markus Follmann|Jan Philipp Sachs|Udo Hahn|Matthieu-P. Schapranow","title":"GGPONC: A Corpus of German Medical Text with Rich Metadata Based on Clinical Practice Guidelines"},{"content":{"abstract":"Medical concept normalization helps in discovering standard concepts in free-form text i.e., maps health-related mentions to standard concepts in a clinical knowledge base. It is much beyond simple string matching and requires a deep semantic understanding of concept mentions. Recent research approach concept normalization as either text classification or text similarity. The main drawback in existing a) text classification approach is ignoring valuable target concepts information in learning input concept mention representation b) text similarity approach is the need to separately generate target concept embeddings which is time and resource consuming. Our proposed model overcomes these drawbacks by jointly learning the representations of input concept mention and target concepts. First, we learn input concept mention representation using RoBERTa. Second, we find cosine similarity between embeddings of input concept mention and all the target concepts. Here, embeddings of target concepts are randomly initialized and then updated during training. Finally, the target concept with maximum cosine similarity is assigned to the input concept mention. Our model surpasses all the existing methods across three standard datasets by improving accuracy up to 2.31%.","authors":["Katikapalli Subramanyam Kalyan","Sivanesan Sangeetha"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.3","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Medical Concept Normalization in User-Generated Texts by Learning Target Concept Embeddings","tldr":"Medical concept normalization helps in discovering standard concepts in free-form text i.e., maps health-related mentions to standard concepts in a clinical knowledge base. It is much beyond simple string matching and requires a deep semantic underst...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.17","presentation_id":"38940046","rocketchat_channel":"paper-louhi2020-17","speakers":"Katikapalli Subramanyam Kalyan|Sivanesan Sangeetha","title":"Medical Concept Normalization in User-Generated Texts by Learning Target Concept Embeddings"},{"content":{"abstract":"The impact of de-identification on data quality and, in particular, utility for developing models for downstream tasks has been more thoroughly studied for structured data than for unstructured text. While previous studies indicate that text de-identification has a limited impact on models for downstream tasks, it remains unclear what the impact is with various levels and forms of de-identification, in particular concerning the trade-off between precision and recall. In this paper, the impact of de-identification is studied on downstream named entity recognition in Swedish clinical text. The results indicate that de-identification models with moderate to high precision lead to similar downstream performance, while low precision has a substantial negative impact. Furthermore, different strategies for concealing sensitive information affect performance to different degrees, ranging from pseudonymisation having a low impact to the removal of entire sentences with sensitive information having a high impact. This study indicates that it is possible to increase the recall of models for identifying sensitive information without negatively affecting the use of de-identified text data for training models for clinical named entity recognition; however, there is ultimately a trade-off between the level of de-identification and the subsequent utility of the data.","authors":["Hanna Berg","Aron Henriksson","Hercules Dalianis"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.1","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"The Impact of De-identification on Downstream Named Entity Recognition in Clinical Text","tldr":"The impact of de-identification on data quality and, in particular, utility for developing models for downstream tasks has been more thoroughly studied for structured data than for unstructured text. While previous studies indicate that text de-ident...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.2","presentation_id":"38940038","rocketchat_channel":"paper-louhi2020-2","speakers":"Hanna Berg|Aron Henriksson|Hercules Dalianis","title":"The Impact of De-identification on Downstream Named Entity Recognition in Clinical Text"},{"content":{"abstract":"We present refinements over existing temporal relation annotations in the Electronic Medical Record clinical narrative. We refined the THYME corpus annotations to more faithfully represent nuanced temporality and nuanced temporal-coreferential relations. The main contributions are in re-defining CONTAINS and OVERLAP relations into CONTAINS, CONTAINS-SUBEVENT, OVERLAP and NOTED-ON. We demonstrate that these refinements lead to substantial gains in learnability for state-of-the-art transformer models as compared to previously reported results on the original THYME corpus. We thus establish a baseline for the automatic extraction of these refined temporal relations. Although our study is done on clinical narrative, we believe it addresses far-reaching challenges that are corpus- and domain- agnostic.","authors":["Kristin Wright-Bettner","Chen Lin","Timothy Miller","Steven Bethard","Dmitriy Dligach","Martha Palmer","James H. Martin","Guergana Savova"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.12","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Defining and Learning Refined Temporal Relations in the Clinical Narrative","tldr":"We present refinements over existing temporal relation annotations in the Electronic Medical Record clinical narrative. We refined the THYME corpus annotations to more faithfully represent nuanced temporality and nuanced temporal-coreferential relati...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.24","presentation_id":"38940047","rocketchat_channel":"paper-louhi2020-24","speakers":"Kristin Wright-Bettner|Chen Lin|Timothy Miller|Steven Bethard|Dmitriy Dligach|Martha Palmer|James H. Martin|Guergana Savova","title":"Defining and Learning Refined Temporal Relations in the Clinical Narrative"},{"content":{"abstract":"Recognising and linking entities is a crucial first step to many tasks in biomedical text analysis, such as relation extraction and target identification. Traditionally, biomedical entity linking methods rely heavily on heuristic rules and predefined, often domain-specific features. The features try to capture the properties of entities and complex multi-step architectures to detect, and subsequently link entity mentions. We propose a significant simplification to the biomedical entity linking setup that does not rely on any heuristic methods. The system performs all the steps of the entity linking task jointly in either single or two stages. We explore the use of hierarchical multi-task learning, using mention recognition and entity typing tasks as auxiliary tasks. We show that hierarchical multi-task models consistently outperform single-task models when trained tasks are homogeneous. We evaluate the performance of our models on the biomedical entity linking benchmarks using MedMentions and BC5CDR datasets. We achieve state-of-theart results on the challenging MedMentions dataset, and comparable results on BC5CDR.","authors":["Maciej Wiatrak","Juha Iso-Sipila"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.2","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Simple Hierarchical Multi-Task Neural End-To-End Entity Linking for Biomedical Text","tldr":"Recognising and linking entities is a crucial first step to many tasks in biomedical text analysis, such as relation extraction and target identification. Traditionally, biomedical entity linking methods rely heavily on heuristic rules and predefined...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.26","presentation_id":"38940048","rocketchat_channel":"paper-louhi2020-26","speakers":"Maciej Wiatrak|Juha Iso-Sipila","title":"Simple Hierarchical Multi-Task Neural End-To-End Entity Linking for Biomedical Text"},{"content":{"abstract":"We address the problem of automatic detection of psychiatric disorders from the linguistic content of social media posts. We build a large scale dataset of Reddit posts from users with eight disorders and a control user group. We extract and analyze linguistic characteristics of posts and identify differences between diagnostic groups. We build strong classification models based on deep contextualized word representations and show that they outperform previously applied statistical models with simple linguistic features by large margins. We compare user-level and post-level classification performance, as well as an ensembled multiclass model.","authors":["Zhengping Jiang","Sarah Ita Levitan","Jonathan Zomick","Julia Hirschberg"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.16","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Detection of Mental Health from Reddit via Deep Contextualized Representations","tldr":"We address the problem of automatic detection of psychiatric disorders from the linguistic content of social media posts. We build a large scale dataset of Reddit posts from users with eight disorders and a control user group. We extract and analyze ...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.27","presentation_id":"38940049","rocketchat_channel":"paper-louhi2020-27","speakers":"Zhengping Jiang|Sarah Ita Levitan|Jonathan Zomick|Julia Hirschberg","title":"Detection of Mental Health from Reddit via Deep Contextualized Representations"},{"content":{"abstract":"","authors":["Sarah Valentin","Renaud Lancelot","Mathieu Roche"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Information retrieval for animal disease surveillance: a pattern-based approach","tldr":null,"track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.28","presentation_id":"38940050","rocketchat_channel":"paper-louhi2020-28","speakers":"Sarah Valentin|Renaud Lancelot|Mathieu Roche","title":"Information retrieval for animal disease surveillance: a pattern-based approach"},{"content":{"abstract":"Post-market surveillance, the practice of monitoring the safe use of pharmaceutical drugs is an important part of pharmacovigilance. Being able to collect personal experience related to pharmaceutical product use could help us gain insight into how the human body reacts to different medications. Twitter, a popular social media service, is being considered as an important alternative data source for collecting personal experience information with medications. Identifying personal experience tweets is a challenging classification task in natural language processing. In this study, we utilized three methods based on Facebook’s Robustly Optimized BERT Pretraining Approach (RoBERTa) to predict personal experience tweets related to medication use: the first one combines the pre-trained RoBERTa model with a classifier, the second combines the updated pre-trained RoBERTa model using a corpus of unlabeled tweets with a classifier, and the third combines the RoBERTa model that was trained with our unlabeled tweets from scratch with the classifier too. Our results show that all of these approaches outperform the published methods (Word Embedding + LSTM) in classification performance (p < 0.05), and updating the pre-trained language model with tweets related to medications could even improve the performance further.","authors":["Minghao Zhu","Youzhe Song","Ge Jin","Keyuan Jiang"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.14","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Identifying Personal Experience Tweets of Medication Effects Using Pre-trained RoBERTa Language Model and Its Updating","tldr":"Post-market surveillance, the practice of monitoring the safe use of pharmaceutical drugs is an important part of pharmacovigilance. Being able to collect personal experience related to pharmaceutical product use could help us gain insight into how t...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.32","presentation_id":"38940051","rocketchat_channel":"paper-louhi2020-32","speakers":"Minghao Zhu|Youzhe Song|Ge Jin|Keyuan Jiang","title":"Identifying Personal Experience Tweets of Medication Effects Using Pre-trained RoBERTa Language Model and Its Updating"},{"content":{"abstract":"Health departments have been deploying text classification systems for the early detection of foodborne illness complaints in social media documents such as Yelp restaurant reviews. Current systems have been successfully applied for documents in English and, as a result, a promising direction is to increase coverage and recall by considering documents in additional languages, such as Spanish or Chinese. Training previous systems for more languages, however, would be expensive, as it would require the manual annotation of many documents for each new target language. To address this challenge, we consider cross-lingual learning and train multilingual classifiers using only the annotations for English-language reviews. Recent zero-shot approaches based on pre-trained multi-lingual BERT (mBERT) have been shown to effectively align languages for aspects such as sentiment. Interestingly, we show that those approaches are less effective for capturing the nuances of foodborne illness, our public health application of interest. To improve performance without extra annotations, we create artificial training documents in the target language through machine translation and train mBERT jointly for the source (English) and target language. Furthermore, we show that translating labeled documents to multiple languages leads to additional performance improvements for some target languages. We demonstrate the benefits of our approach through extensive experiments with Yelp restaurant reviews in seven languages. Our classifiers identify foodborne illness complaints in multilingual reviews from the Yelp Challenge dataset, which highlights the potential of our general approach for deployment in health departments.","authors":["Ziyi Liu","Giannis Karamanolakis","Daniel Hsu","Luis Gravano"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.15","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Detecting Foodborne Illness Complaints in Multiple Languages Using English Annotations Only","tldr":"Health departments have been deploying text classification systems for the early detection of foodborne illness complaints in social media documents such as Yelp restaurant reviews. Current systems have been successfully applied for documents in Engl...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.35","presentation_id":"38940052","rocketchat_channel":"paper-louhi2020-35","speakers":"Ziyi Liu|Giannis Karamanolakis|Daniel Hsu|Luis Gravano","title":"Detecting Foodborne Illness Complaints in Multiple Languages Using English Annotations Only"},{"content":{"abstract":"The automatic mapping of Adverse Drug Reaction (ADR) reports from user-generated content to concepts in a controlled medical vocabulary provides valuable insights for monitoring public health. While state-of-the-art deep learning-based sequence classification techniques achieve impressive performance for medical concepts with large amounts of training data, they show their limit with long-tail concepts that have a low number of training samples. The above hinders their adaptability to the changes of layman’s terminology and the constant emergence of new informal medical terms. Our objective in this paper is to tackle the problem of normalizing long-tail ADR mentions in user-generated content. In this paper, we exploit the implicit semantics of rare ADRs for which we have few training samples, in order to detect the most similar class for the given ADR. The evaluation results demonstrate that our proposed approach addresses the limitations of the existing techniques when the amount of training data is limited.","authors":["Emmanouil Manousogiannis","Sepideh Mesbah","Alessandro Bozzon","Robert-Jan Sips","Zoltan Szlanik","Selene Baez"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.6","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Normalization of Long-tail Adverse Drug Reactions in Social Media","tldr":"The automatic mapping of Adverse Drug Reaction (ADR) reports from user-generated content to concepts in a controlled medical vocabulary provides valuable insights for monitoring public health. While state-of-the-art deep learning-based sequence class...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.4","presentation_id":"38940039","rocketchat_channel":"paper-louhi2020-4","speakers":"Emmanouil Manousogiannis|Sepideh Mesbah|Alessandro Bozzon|Robert-Jan Sips|Zoltan Szlanik|Selene Baez","title":"Normalization of Long-tail Adverse Drug Reactions in Social Media"},{"content":{"abstract":"Healthcare systems have increased patients’ exposure to their own health materials to enhance patients’ health levels, but this has been impeded by patients’ lack of understanding of their health material. We address potential barriers to their comprehension by developing a context-aware text simplification system for health material. Given the scarcity of annotated parallel corpora in healthcare domains, we design our system to be independent of a parallel corpus, complementing the availability of data-driven neural methods when such corpora are available. Our system compensates for the lack of direct supervision using a biomedical lexical database: Unified Medical Language System (UMLS). Compared to a competitive prior approach that uses a tool for identifying biomedical concepts and a consumer-directed vocabulary list, we empirically show the enhanced accuracy of our system due to improved handling of ambiguous terms. We also show the enhanced accuracy of our system over directly-supervised neural methods in this low-resource setting. Finally, we show the direct impact of our system on laypeople’s comprehension of health material via a human subjects’ study (n=160).","authors":["Tarek Sakakini","Jong Yoon Lee","Aditya Duri","Renato F.L. Azevedo","Victor Sadauskas","Kuangxiao Gu","Suma Bhat","Dan Morrow","James Graumlich","Saqib Walayat","Mark Hasegawa-Johnson","Thomas Huang","Ann Willemsen-Dunlap","Donald Halpin"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.13","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Context-Aware Automatic Text Simplification of Health Materials in Low-Resource Domains","tldr":"Healthcare systems have increased patients’ exposure to their own health materials to enhance patients’ health levels, but this has been impeded by patients’ lack of understanding of their health material. We address potential barriers to their compr...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.44","presentation_id":"38940053","rocketchat_channel":"paper-louhi2020-44","speakers":"Tarek Sakakini|Jong Yoon Lee|Aditya Duri|Renato F.L. Azevedo|Victor Sadauskas|Kuangxiao Gu|Suma Bhat|Dan Morrow|James Graumlich|Saqib Walayat|Mark Hasegawa-Johnson|Thomas Huang|Ann Willemsen-Dunlap|Donald Halpin","title":"Context-Aware Automatic Text Simplification of Health Materials in Low-Resource Domains"},{"content":{"abstract":"Detecting negation and speculation in language has been a task of considerable interest to the biomedical community, as it is a key component of Information Extraction systems from Biomedical documents. Prior work has individually addressed Negation Detection and Speculation Detection, and both have been addressed in the same way, using 2 stage pipelined approach: Cue Detection followed by Scope Resolution. In this paper, we propose Multitask learning approaches over 2 sets of tasks: Negation Cue Detection & Speculation Cue Detection, and Negation Scope Resolution & Speculation Scope Resolution. We utilise transformer-based architectures like BERT, XLNet and RoBERTa as our core model architecture, and finetune these using the Multitask learning approaches. We show that this Multitask Learning approach outperforms the single task learning approach, and report new state-of-the-art results on Negation and Speculation Scope Resolution on the BioScope Corpus and the SFU Review Corpus.","authors":["Aditya Khandelwal","Benita Kathleen Britto"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.9","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Multitask Learning of Negation and Speculation using Transformers","tldr":"Detecting negation and speculation in language has been a task of considerable interest to the biomedical community, as it is a key component of Information Extraction systems from Biomedical documents. Prior work has individually addressed Negation ...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.5","presentation_id":"38940040","rocketchat_channel":"paper-louhi2020-5","speakers":"Aditya Khandelwal|Benita Kathleen Britto","title":"Multitask Learning of Negation and Speculation using Transformers"},{"content":{"abstract":"In this work we addressed the problem of capturing sequential information contained in longitudinal electronic health records (EHRs). Clinical notes, which is a particular type of EHR data, are a rich source of information and practitioners often develop clever solutions how to maximise the sequential information contained in free-texts. We proposed a systematic methodology for learning from chronological events available in clinical notes. The proposed methodological path signature framework creates a non-parametric hierarchical representation of sequential events of any type and can be used as features for downstream statistical learning tasks. The methodology was developed and externally validated using the largest in the UK secondary care mental health EHR data on a specific task of predicting survival risk of patients diagnosed with Alzheimer’s disease. The signature-based model was compared to a common survival random forest model. Our results showed a 15.4% increase of risk prediction AUC at the time point of 20 months after the first admission to a specialist memory clinic and the signature method outperformed the baseline mixed-effects model by 13.2 %.","authors":["Andrey Kormilitzin","Nemanja Vaci","Qiang Liu","Hao Ni","Goran Nenadic","Alejo Nevado-Holgado"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.11","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"An efficient representation of chronological events in medical texts","tldr":"In this work we addressed the problem of capturing sequential information contained in longitudinal electronic health records (EHRs). Clinical notes, which is a particular type of EHR data, are a rich source of information and practitioners often dev...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.8","presentation_id":"38940041","rocketchat_channel":"paper-louhi2020-8","speakers":"Andrey Kormilitzin|Nemanja Vaci|Qiang Liu|Hao Ni|Goran Nenadic|Alejo Nevado-Holgado","title":"An efficient representation of chronological events in medical texts"},{"content":{"abstract":"Animal diseases-related news articles are richin information useful for risk assessment. In this paper, we explore a method to automatically retrieve sentence-level epidemiological information. Our method is an incremental approach to create and expand patterns at both lexical and syntactic levels. Expert knowledge input are used at different steps of the approach. Distributed vector representations (word embedding) were used to expand the patterns at the lexical level, thus alleviating manual curation. We showed that expert validation was crucial to improve the precision of automatically generated patterns.","authors":["Sarah Valentin","Mathieu Roche","Renaud Lancelot"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.louhi-1.8","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Information retrieval for animal disease surveillance: a pattern-based approach.","tldr":"Animal diseases-related news articles are richin information useful for risk assessment. In this paper, we explore a method to automatically retrieve sentence-level epidemiological information. Our method is an incremental approach to create and expa...","track":"LOUHI 2020 - 11th International Workshop on Health Text Mining and Information Analysis"},"id":"WS-19.2020.louhi-1.8","presentation_id":"","rocketchat_channel":"paper-louhi2020-8","speakers":"Sarah Valentin|Mathieu Roche|Renaud Lancelot","title":"Information retrieval for animal disease surveillance: a pattern-based approach."}]
