[{"content":{"abstract":"Recent years have seen an increase in the number of large-scale multilingual NLP projects. However, even in such projects, languages with special processing requirements are often excluded. One such language is Japanese. Japanese is written without spaces, tokenization is non-trivial, and while high quality open source tokenizers exist they can be hard to use and lack English documentation. This paper introduces fugashi, a MeCab wrapper for Python, and gives an introduction to tokenizing Japanese.","authors":["Paul McCann"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.7","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"fugashi, a Tool for Tokenizing Japanese in Python","tldr":"Recent years have seen an increase in the number of large-scale multilingual NLP projects. However, even in such projects, languages with special processing requirements are often excluded. One such language is Japanese. Japanese is written without s...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.10","presentation_id":"38939744","rocketchat_channel":"paper-nlposs-10","speakers":"Paul McCann","title":"fugashi, a Tool for Tokenizing Japanese in Python"},{"content":{"abstract":"We introduce whatlies, an open source toolkit for visually inspecting word and sentence embeddings. The project offers a unified and extensible API with current support for a range of popular embedding backends including spaCy, tfhub, huggingface transformers, gensim, fastText and BytePair embeddings. The package combines a domain specific language for vector arithmetic with visualisation tools that make exploring word embeddings more intuitive and concise. It offers support for many popular dimensionality reduction techniques as well as many interactive visualisations that can either be statically exported or shared via Jupyter notebooks. The project documentation is available from https://rasahq.github.io/whatlies/.","authors":["Vincent Warmerdam","Thomas Kober","Rachael Tatman"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.8","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Going Beyond T-SNE: Exposing whatlies in Text Embeddings","tldr":"We introduce whatlies, an open source toolkit for visually inspecting word and sentence embeddings. The project offers a unified and extensible API with current support for a range of popular embedding backends including spaCy, tfhub, huggingface tra...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.11","presentation_id":"38939745","rocketchat_channel":"paper-nlposs-11","speakers":"Vincent Warmerdam|Thomas Kober|Rachael Tatman","title":"Going Beyond T-SNE: Exposing whatlies in Text Embeddings"},{"content":{"abstract":"We describe Howl, an open-source wake word detection toolkit with native support for open speech datasets such as Mozilla Common Voice (MCV) and Google Speech Commands (GSC). We report benchmark results of various models supported by our toolkit on GSC and our own freely available wake word detection dataset, built from MCV. One of our models is deployed in Firefox Voice, a plugin enabling speech interactivity for the Firefox web browser. Howl represents, to the best of our knowledge, the first fully productionized, open-source wake word detection toolkit with a web browser deployment target. Our codebase is at howl.ai.","authors":["Raphael Tang","Jaejun Lee","Afsaneh Razi","Julia Cambre","Ian Bicking","Jofish Kaye","Jimmy Lin"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.9","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Howl: A Deployed, Open-Source Wake Word Detection System","tldr":"We describe Howl, an open-source wake word detection toolkit with native support for open speech datasets such as Mozilla Common Voice (MCV) and Google Speech Commands (GSC). We report benchmark results of various models supported by our toolkit on G...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.12","presentation_id":"38939746","rocketchat_channel":"paper-nlposs-12","speakers":"Raphael Tang|Jaejun Lee|Afsaneh Razi|Julia Cambre|Ian Bicking|Jofish Kaye|Jimmy Lin","title":"Howl: A Deployed, Open-Source Wake Word Detection System"},{"content":{"abstract":"We present iNLTK, an open-source NLP library consisting of pre-trained language models and out-of-the-box support for Data Augmentation, Textual Similarity, Sentence Embeddings, Word Embeddings, Tokenization and Text Generation in 13 Indic Languages. By using pre-trained models from iNLTK for text classification on publicly available datasets, we significantly outperform previously reported results. On these datasets, we also show that by using pre-trained models and data augmentation from iNLTK, we can achieve more than 95% of the previous best performance by using less than 10% of the training data. iNLTK is already being widely used by the community and has 40,000+ downloads, 600+ stars and 100+ forks on GitHub. The library is available at https://github.com/goru001/inltk.","authors":["Gaurav Arora"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.10","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"iNLTK: Natural Language Toolkit for Indic Languages","tldr":"We present iNLTK, an open-source NLP library consisting of pre-trained language models and out-of-the-box support for Data Augmentation, Textual Similarity, Sentence Embeddings, Word Embeddings, Tokenization and Text Generation in 13 Indic Languages....","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.13","presentation_id":"38939747","rocketchat_channel":"paper-nlposs-13","speakers":"Gaurav Arora","title":"iNLTK: Natural Language Toolkit for Indic Languages"},{"content":{"abstract":"Many tasks in natural language processing, such as named entity recognition and slot-filling, involve identifying and labeling specific spans of text. In order to leverage common models, these tasks are often recast as sequence labeling tasks. Each token is given a label and these labels are prefixed with special tokens such as B- or I-. After a model assigns labels to each token, these prefixes are used to group the tokens into spans. Properly parsing these annotations is critical for producing fair and comparable metrics; however, despite its importance, there is not an easy-to-use, standardized, programmatically integratable library to help work with span labeling. To remedy this, we introduce our open-source library, iobes. iobes is used for parsing, converting, and processing spans represented as token level decisions.","authors":["Brian Lester"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.16","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"iobes: Library for Span Level Processing","tldr":"Many tasks in natural language processing, such as named entity recognition and slot-filling, involve identifying and labeling specific spans of text. In order to leverage common models, these tasks are often recast as sequence labeling tasks. Each t...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.14","presentation_id":"38939748","rocketchat_channel":"paper-nlposs-14","speakers":"Brian Lester","title":"iobes: Library for Span Level Processing"},{"content":{"abstract":"","authors":["Yada Pruksachatkun","Phil Yeres","Haokun Liu","Jason Phang","Phu Mon Htut","Alex Wang","Ian Tenney","Samuel R. Bowman"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"jiant: A Software Toolkit for Research on General-Purpose Text Understanding Models","tldr":null,"track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.15","presentation_id":"38939749","rocketchat_channel":"paper-nlposs-15","speakers":"Yada Pruksachatkun|Phil Yeres|Haokun Liu|Jason Phang|Phu Mon Htut|Alex Wang|Ian Tenney|Samuel R. Bowman","title":"jiant: A Software Toolkit for Research on General-Purpose Text Understanding Models"},{"content":{"abstract":"Despite the recent advances in applying language-independent approaches to various natural language processing tasks thanks to artificial intelligence, some language-specific tools are still essential to process a language in a viable manner. Kurdish language is a less-resourced language with a remarkable diversity in dialects and scripts and lacks basic language processing tools. To address this issue, we introduce a language processing toolkit to handle such a diversity in an efficient way. Our toolkit is composed of fundamental components such as text preprocessing, stemming, tokenization, lemmatization and transliteration and is able to get further extended by future developers. The project is publicly available.","authors":["Sina Ahmadi"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.11","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"KLPT – Kurdish Language Processing Toolkit","tldr":"Despite the recent advances in applying language-independent approaches to various natural language processing tasks thanks to artificial intelligence, some language-specific tools are still essential to process a language in a viable manner. Kurdish...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.16","presentation_id":"38939750","rocketchat_channel":"paper-nlposs-16","speakers":"Sina Ahmadi","title":"KLPT – Kurdish Language Processing Toolkit"},{"content":{"abstract":"Korean is often referred to as a low-resource language in the research community. While this claim is partially true, it is also because the availability of resources is inadequately advertised and curated. This work curates and reviews a list of Korean corpora, first describing institution-level resource development, then further iterate through a list of current open datasets for different types of tasks. We then propose a direction on how open-source dataset construction and releases should be done for less-resourced languages to promote research.","authors":["Won Ik Cho","Sangwhan Moon","Youngsook Song"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.12","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Open Korean Corpora: A Practical Report","tldr":"Korean is often referred to as a low-resource language in the research community. While this claim is partially true, it is also because the availability of resources is inadequately advertised and curated. This work curates and reviews a list of Kor...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.17","presentation_id":"38939751","rocketchat_channel":"paper-nlposs-17","speakers":"Won Ik Cho|Sangwhan Moon|Youngsook Song","title":"Open Korean Corpora: A Practical Report"},{"content":{"abstract":"This document describes shared development of finite-state description of two closely related but endangered minority languages, Erzya and Moksha. It touches upon morpholexical unity and diversity of the two languages and how this provides a motivation for shared open-source FST development. We describe how we have designed the transducers so that they can benefit from existing open-source infrastructures and are as reusable as possible.","authors":["Jack Rueter","Mika Hämäläinen","Niko Partanen"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.13","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Open-Source Morphology for Endangered Mordvinic Languages","tldr":"This document describes shared development of finite-state description of two closely related but endangered minority languages, Erzya and Moksha. It touches upon morpholexical unity and diversity of the two languages and how this provides a motivati...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.18","presentation_id":"38939752","rocketchat_channel":"paper-nlposs-18","speakers":"Jack Rueter|Mika Hämäläinen|Niko Partanen","title":"Open-Source Morphology for Endangered Mordvinic Languages"},{"content":{"abstract":"We present Pimlico, an open source toolkit for building pipelines for processing large corpora. It is especially focused on processing linguistic corpora and provides wrappers around existing, widely used NLP tools. A particular goal is to ease distribution of reproducible and extensible experiments by making it easy to document and re-run all steps involved, including data loading, pre-processing, model training and evaluation. Once a pipeline is released, it is easy to adapt, for example, to run on a new dataset, or to re-run an experiment with different parameters. The toolkit takes care of many common challenges in writing and distributing corpus-processing code, such as managing data between the steps of a pipeline, installing required software and combining existing toolkits with new, task-specific code.","authors":["Mark Granroth-Wilding"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.14","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Pimlico: A toolkit for corpus-processing pipelines and reproducible experiments","tldr":"We present Pimlico, an open source toolkit for building pipelines for processing large corpora. It is especially focused on processing linguistic corpora and provides wrappers around existing, widely used NLP tools. A particular goal is to ease distr...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.19","presentation_id":"38939753","rocketchat_channel":"paper-nlposs-19","speakers":"Mark Granroth-Wilding","title":"Pimlico: A toolkit for corpus-processing pipelines and reproducible experiments"},{"content":{"abstract":"We present a rule-based sentence boundary disambiguation Python package that works out-of-the-box for 22 languages. We aim to provide a realistic segmenter which can provide logical sentences even when the format and domain of the input text is unknown. In our work, we adapt the Golden Rules Set (a language specific set of sentence boundary exemplars) originally implemented as a ruby gem pragmatic segmenter which we ported to Python with additional improvements and functionality. PySBD passes 97.92% of the Golden Rule Set examplars for English, an improvement of 25% over the next best open source Python tool.","authors":["Nipun Sadvilkar","Mark Neumann"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.15","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"PySBD: Pragmatic Sentence Boundary Disambiguation","tldr":"We present a rule-based sentence boundary disambiguation Python package that works out-of-the-box for 22 languages. We aim to provide a realistic segmenter which can provide logical sentences even when the format and domain of the input text is unkno...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.20","presentation_id":"38939754","rocketchat_channel":"paper-nlposs-20","speakers":"Nipun Sadvilkar|Mark Neumann","title":"PySBD: Pragmatic Sentence Boundary Disambiguation"},{"content":{"abstract":"We present SacreROUGE, an open-source library for using and developing summarization evaluation metrics. SacreROUGE removes many obstacles that researchers face when using or developing metrics: (1) The library provides Python wrappers around the official implementations of existing evaluation metrics so they share a common, easy-to-use interface; (2) it provides functionality to evaluate how well any metric implemented in the library correlates to human-annotated judgments, so no additional code needs to be written for a new evaluation metric; and (3) it includes scripts for loading datasets that contain human judgments so they can easily be used for evaluation. This work describes the design of the library, including the core Metric interface, the command-line API for evaluating summarization models and metrics, and the scripts to load and reformat publicly available datasets. The development of SacreROUGE is ongoing and open to contributions from the community.","authors":["Daniel Deutsch","Dan Roth"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.17","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"SacreROUGE: An Open-Source Library for Using and Developing Summarization Evaluation Metrics","tldr":"We present SacreROUGE, an open-source library for using and developing summarization evaluation metrics. SacreROUGE removes many obstacles that researchers face when using or developing metrics: (1) The library provides Python wrappers around the off...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.21","presentation_id":"38939755","rocketchat_channel":"paper-nlposs-21","speakers":"Daniel Deutsch|Dan Roth","title":"SacreROUGE: An Open-Source Library for Using and Developing Summarization Evaluation Metrics"},{"content":{"abstract":"TextAttack is an open-source Python toolkit for adversarial attacks, adversarial training, and data augmentation in NLP. TextAttack unites 15+ papers from the NLP adversarial attack literature into a single framework, with many components reused across attacks. This framework allows both researchers and developers to test and study the weaknesses of their NLP models. To build such an open-source NLP toolkit requires solving some common problems: How do we enable users to supply models from different deep learning frameworks? How can we build tools to support as many different datasets as possible? We share our insights into developing a well-written, well-documented NLP Python framework in hope that they can aid future development of similar packages.","authors":["John Morris","Jin Yong Yoo","Yanjun Qi"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.18","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"TextAttack: Lessons learned in designing Python frameworks for NLP","tldr":"TextAttack is an open-source Python toolkit for adversarial attacks, adversarial training, and data augmentation in NLP. TextAttack unites 15+ papers from the NLP adversarial attack literature into a single framework, with many components reused acro...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.22","presentation_id":"38939756","rocketchat_channel":"paper-nlposs-22","speakers":"John Morris|Jin Yong Yoo|Yanjun Qi","title":"TextAttack: Lessons learned in designing Python frameworks for NLP"},{"content":{"abstract":"From LDA to neural models, different topic modeling approaches have been proposed in the literature. However, their suitability and performance is not easy to compare, particularly when the algorithms are being used in the wild on heterogeneous datasets. In this paper, we introduce ToModAPI (TOpic MOdeling API), a wrapper library to easily train, evaluate and infer using different topic modeling algorithms through a unified interface. The library is extensible and can be used in Python environments or through a Web API.","authors":["Pasquale Lisena","Ismail Harrando","Oussama Kandakji","Raphael Troncy"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.19","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"TOMODAPI: A Topic Modeling API to Train, Use and Compare Topic Models","tldr":"From LDA to neural models, different topic modeling approaches have been proposed in the literature. However, their suitability and performance is not easy to compare, particularly when the algorithms are being used in the wild on heterogeneous datas...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.23","presentation_id":"38939757","rocketchat_channel":"paper-nlposs-23","speakers":"Pasquale Lisena|Ismail Harrando|Oussama Kandakji|Raphael Troncy","title":"TOMODAPI: A Topic Modeling API to Train, Use and Compare Topic Models"},{"content":{"abstract":"For the last 5 years, we have developed and maintained RSMTool – an open-source tool for evaluating NLP systems that automatically score written and spoken responses. RSMTool is designed to be cross-disciplinary, borrowing heavily from NLP, machine learning, and educational measurement. Its cross-disciplinary nature has required us to learn a user-centered development approach in terms of both design and implementation. We share some of these lessons in this paper.","authors":["Nitin Madnani","Anastassia Loukina"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.20","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"User-centered & Robust NLP OSS: Lessons Learned from Developing & Maintaining RSMTool","tldr":"For the last 5 years, we have developed and maintained RSMTool – an open-source tool for evaluating NLP systems that automatically score written and spoken responses. RSMTool is designed to be cross-disciplinary, borrowing heavily from NLP, machine l...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.24","presentation_id":"38939758","rocketchat_channel":"paper-nlposs-24","speakers":"Nitin Madnani|Anastassia Loukina","title":"User-centered & Robust NLP OSS: Lessons Learned from Developing & Maintaining RSMTool"},{"content":{"abstract":"The WordNet database of English (Fellbaum, 1998) is a key source of semantic information for research and development of natural language processing applications. As the sophistication of these applications increases with the use of large datasets, deep learning, and graph-based methods, so should the use of WordNet. To this end, we introduce WAFFLE: WordNet Applied to FreeForm Linguistic Exploration which makes WordNet available in an open source graph data structure. The WAFFLE graph relies on platform agnostic formats for robust interrogation and flexibility. Where existing implementations of WordNet offer dictionary-like lookup, single degree neighborhood operations, and path based similarity-scoring, the WAFFLE graph makes all nodes (semantic relation sets) and relationships queryable at scale, enabling local and global analysis of all relationships without the need for custom code. We demonstrate WAFFLE’s ease of use, visualization capabilities, and scalable efficiency with common queries, operations, and interactions. WAFFLE is available at github.com/TRSS-NLP/WAFFLE.","authors":["Berk Ekmekci","Blake Howald"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.21","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"WAFFLE: A Graph for WordNet Applied to FreeForm Linguistic Exploration","tldr":"The WordNet database of English (Fellbaum, 1998) is a key source of semantic information for research and development of natural language processing applications. As the sophistication of these applications increases with the use of large datasets, d...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.25","presentation_id":"38939759","rocketchat_channel":"paper-nlposs-25","speakers":"Berk Ekmekci|Blake Howald","title":"WAFFLE: A Graph for WordNet Applied to FreeForm Linguistic Exploration"},{"content":{"abstract":"Conversational agents can be used to make diagnoses, classify mental states, promote health education, and provide emotional support. The benefits of adopting conversational agents include widespread access, increased treatment engagement, and improved patient relationships with the intervention. We propose here a framework to assist chat operators of mental healthcare services, instead of a fully automated conversational agent. This design eases to avoid the adverse effects of applying chatbots in mental healthcare. The proposed framework is capable of improving the quality and reducing the time of interactions via chat between a user and a chat operator. We also present a case study in the context of health promotion on reducing tobacco use. The proposed framework uses artificial intelligence, specifically natural language processing (NLP) techniques, to classify messages from chat users. A list of suggestions is offered to the chat operator, with topics to be discussed in the session. These suggestions were created based on service protocols and the classification of previous chat sessions. The operator can also edit the suggested messages. Data collected can be used in the future to improve the quality of the suggestions offered.","authors":["Thiago Madeira","Heder Bernardino","Jairo Francisco De Souza","Henrique Gomide","Nathália Munck Machado","Bruno Marcos Pinheiro da Silva","Alexandre Vieira Pereira Pacelli"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.1","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"A Framework to Assist Chat Operators of Mental Healthcare Services","tldr":"Conversational agents can be used to make diagnoses, classify mental states, promote health education, and provide emotional support. The benefits of adopting conversational agents include widespread access, increased treatment engagement, and improv...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.4","presentation_id":"38939738","rocketchat_channel":"paper-nlposs-4","speakers":"Thiago Madeira|Heder Bernardino|Jairo Francisco De Souza|Henrique Gomide|Nathália Munck Machado|Bruno Marcos Pinheiro da Silva|Alexandre Vieira Pereira Pacelli","title":"A Framework to Assist Chat Operators of Mental Healthcare Services"},{"content":{"abstract":"Automating natural language understanding is a lifelong quest addressed for decades. With the help of advances in machine learning and particularly, deep learning, we are able to produce state of the art models that can imitate human interactions with languages. Unfortunately, these advances are controlled by the availability of language resources. Arabic advances in this field , although it has a great potential, are still limited. This is apparent in both research and development. In this paper, we showcase some NLP models we trained for Arabic. We also present our methodology and pipeline to build such models from data collection, data preprocessing, tokenization and model deployment. These tools help in the advancement of the field and provide a systematic approach for extending NLP tools to many languages.","authors":["Zaid Alyafeai","Maged Al-Shaibani"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.2","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"ARBML: Democritizing Arabic Natural Language Processing Tools","tldr":"Automating natural language understanding is a lifelong quest addressed for decades. With the help of advances in machine learning and particularly, deep learning, we are able to produce state of the art models that can imitate human interactions wit...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.5","presentation_id":"38939739","rocketchat_channel":"paper-nlposs-5","speakers":"Zaid Alyafeai|Maged Al-Shaibani","title":"ARBML: Democritizing Arabic Natural Language Processing Tools"},{"content":{"abstract":"The CLEVR dataset has been used extensively in language grounded visual reasoning in Machine Learning (ML) and Natural Language Processing (NLP). We present a graph parser library for CLEVR, that provides functionalities for object-centric attributes and relationships extraction, and construction of structural graph representations for dual modalities. Structural order-invariant representations enable geometric learning and can aid in downstream tasks like language grounding to vision, robotics, compositionality, interpretability, and computational grammar construction. We provide three extensible main components – parser, embedder, and visualizer that can be tailored to suit specific learning setups. We also provide out-of-the-box functionality for seamless integration with popular deep graph neural network (GNN) libraries. Additionally, we discuss downstream usage and applications of the library, and how it can accelerate research for the NLP community.","authors":["Raeid Saqur","Ameet Deshpande"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.3","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"CLEVR Parser: A Graph Parser Library for Geometric Learning on Language Grounded Image Scenes","tldr":"The CLEVR dataset has been used extensively in language grounded visual reasoning in Machine Learning (ML) and Natural Language Processing (NLP). We present a graph parser library for CLEVR, that provides functionalities for object-centric attributes...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.6","presentation_id":"38939740","rocketchat_channel":"paper-nlposs-6","speakers":"Raeid Saqur|Ameet Deshpande","title":"CLEVR Parser: A Graph Parser Library for Geometric Learning on Language Grounded Image Scenes"},{"content":{"abstract":"The recent progress in natural language processing research has been supported by the development of a rich open source ecosystem in Python. Libraries allowing NLP practitioners but also non-specialists to leverage state-of-the-art models have been instrumental in the democratization of this technology. The maturity of the open-source NLP ecosystem however varies between languages. This work proposes a new open-source library aimed at bringing state-of-the-art NLP to Rust. Rust is a systems programming language for which the foundations required to build machine learning applications are available but still lacks ready-to-use, end-to-end NLP libraries. The proposed library, rust-bert, implements modern language models and ready-to-use pipelines (for example translation or summarization). This allows further development by the Rust community from both NLP experts and non-specialists. It is hoped that this library will accelerate the development of the NLP ecosystem in Rust. The library is under active development and available at https://github.com/guillaume-be/rust-bert.","authors":["Guillaume Becquin"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.4","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"End-to-end NLP Pipelines in Rust","tldr":"The recent progress in natural language processing research has been supported by the development of a rich open source ecosystem in Python. Libraries allowing NLP practitioners but also non-specialists to leverage state-of-the-art models have been i...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.7","presentation_id":"38939741","rocketchat_channel":"paper-nlposs-7","speakers":"Guillaume Becquin","title":"End-to-end NLP Pipelines in Rust"},{"content":{"abstract":"Non-contextual word embedding models have been shown to inherit human-like stereotypical biases of gender, race and religion from the training corpora. To counter this issue, a large body of research has emerged which aims to mitigate these biases while keeping the syntactic and semantic utility of embeddings intact. This paper describes Fair Embedding Engine (FEE), a library for analysing and mitigating gender bias in word embeddings. FEE combines various state of the art techniques for quantifying, visualising and mitigating gender bias in word embeddings under a standard abstraction. FEE will aid practitioners in fast track analysis of existing debiasing methods on their embedding models. Further, it will allow rapid prototyping of new methods by evaluating their performance on a suite of standard metrics.","authors":["Vaibhav Kumar","Tenzin Bhotia","Vaibhav Kumar"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.5","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Fair Embedding Engine: A Library for Analyzing and Mitigating Gender Bias in Word Embeddings","tldr":"Non-contextual word embedding models have been shown to inherit human-like stereotypical biases of gender, race and religion from the training corpora. To counter this issue, a large body of research has emerged which aims to mitigate these biases wh...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.8","presentation_id":"38939742","rocketchat_channel":"paper-nlposs-8","speakers":"Vaibhav Kumar|Tenzin Bhotia|Vaibhav Kumar","title":"Fair Embedding Engine: A Library for Analyzing and Mitigating Gender Bias in Word Embeddings"},{"content":{"abstract":"Our objective is to introduce to the NLP community NMSLIB, describe a new retrieval toolkit FlexNeuART, as well as their integration capabilities. NMSLIB, while being one the fastest k-NN search libraries, is quite generic and supports a variety of distance/similarity functions. Because the library relies on the distance-based structure-agnostic algorithms, it can be further extended by adding new distances. FlexNeuART is a modular, extendible and flexible toolkit for candidate generation in IR and QA applications, which supports mixing of classic and neural ranking signals. FlexNeuART can efficiently retrieve mixed dense and sparse representations (with weights learned from training data), which is achieved by extending NMSLIB. In that, other retrieval systems work with purely sparse representations (e.g., Lucene), purely dense representations (e.g., FAISS and Annoy), or only perform mixing at the re-ranking stage.","authors":["Leonid Boytsov","Eric Nyberg"],"demo_url":null,"keywords":[],"material":null,"paper_type":"Workshop","pdf_url":"https://www.aclweb.org/anthology/2020.nlposs-1.6","program":"workshop","sessions":[],"similar_paper_uids":[],"title":"Flexible retrieval with NMSLIB and FlexNeuART","tldr":"Our objective is to introduce to the NLP community NMSLIB, describe a new retrieval toolkit FlexNeuART, as well as their integration capabilities. NMSLIB, while being one the fastest k-NN search libraries, is quite generic and supports a variety of d...","track":"Second Workshop for NLP Open Source Software (NLP-OSS)"},"id":"WS-9.9","presentation_id":"38939743","rocketchat_channel":"paper-nlposs-9","speakers":"Leonid Boytsov|Eric Nyberg","title":"Flexible retrieval with NMSLIB and FlexNeuART"}]
