[{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1217.png","content":{"abstract":"(T)ACSA tasks, including aspect-category sentiment analysis (ACSA) and targeted aspect-category sentiment analysis (TACSA), aims at identifying sentiment polarity on predefined categories. Incremental learning on new categories is necessary for (T)ACSA real applications. Though current multi-task learning models achieve good performance in (T)ACSA tasks, they suffer from catastrophic forgetting problems in (T)ACSA incremental learning tasks. In this paper, to make multi-task learning feasible for incremental learning, we proposed Category Name Embedding network (CNE-net). We set both encoder and decoder shared among all categories to weaken the catastrophic forgetting problem. Besides the origin input sentence, we applied another input feature, i.e., category name, for task discrimination. Our model achieved state-of-the-art on two (T)ACSA benchmark datasets. Furthermore, we proposed a dataset for (T)ACSA incremental learning and achieved the best performance compared with other strong baselines.","authors":["Zehui Dai","Cheng Peng","Huajie Chen","Yadong Ding"],"demo_url":"","keywords":["tacsa tasks","aspect-category analysis","targeted analysis","multi-task learning"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.565","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.3579","main.3013","main.3185","main.1675","main.3064"],"title":"A Multi-Task Incremental Learning Framework with Category Name Embedding for Aspect-Category Sentiment Analysis","tldr":"(T)ACSA tasks, including aspect-category sentiment analysis (ACSA) and targeted aspect-category sentiment analysis (TACSA), aims at identifying sentiment polarity on predefined categories. Incremental learning on new categories is necessary for (T)AC...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1217","id":"main.1217","presentation_id":"38938865"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1289.png","content":{"abstract":"Aspect-level sentiment analysis aims to recognize the sentiment polarity of an aspect or a target in a comment. Recently, graph convolutional networks based on linguistic dependency trees have been studied for this task. However, the dependency parsing accuracy of commercial product comments or tweets might be unsatisfactory. To tackle this problem, we associate linguistic dependency trees with automatically induced aspectspecific graphs. We propose gating mechanisms to dynamically combine information from word dependency graphs and latent graphs which are learned by self-attention networks. Our model can complement supervised syntactic features with latent semantic dependencies. Experimental results on five benchmarks show the effectiveness of our proposed latent models, giving significantly better results than models without using latent graphs.","authors":["Chenhua Chen","Zhiyang Teng","Yue Zhang"],"demo_url":"","keywords":["aspect-level analysis","graph networks","induced graphs","gating mechanisms"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.451","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 01:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z9C","start_time":"Wed, 18 Nov 2020 00:00:00 GMT"}],"similar_paper_uids":["main.3286","main.1675","main.1766","main.3375","main.1550"],"title":"Inducing Target-Specific Latent Structures for Aspect Sentiment Classification","tldr":"Aspect-level sentiment analysis aims to recognize the sentiment polarity of an aspect or a target in a comment. Recently, graph convolutional networks based on linguistic dependency trees have been studied for this task. However, the dependency parsi...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1289","id":"main.1289","presentation_id":"38938882"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1299.png","content":{"abstract":"Recently, pre-trained language models mostly follow the pre-train-then-fine-tuning paradigm and have achieved great performance on various downstream tasks. However, since the pre-training stage is typically task-agnostic and the fine-tuning stage usually suffers from insufficient supervised data, the models cannot always well capture the domain-specific and task-specific patterns. In this paper, we propose a three-stage framework by adding a task-guided pre-training stage with selective masking between general pre-training and fine-tuning. In this stage, the model is trained by masked language modeling on in-domain unsupervised data to learn domain-specific patterns and we propose a novel selective masking strategy to learn task-specific patterns. Specifically, we design a method to measure the importance of each token in sequences and selectively mask the important tokens. Experimental results on two sentiment analysis tasks show that our method can achieve comparable or even better performance with less than 50\\% of computation cost, which indicates our method is both effective and efficient. The source code of this paper can be obtained from \\url{https://github.com/thunlp/SelectiveMasking}.","authors":["Yuxian Gu","Zhengyan Zhang","Xiaozhi Wang","Zhiyuan Liu","Maosong Sun"],"demo_url":"","keywords":["pre-training stage","fine-tuning stage","general pre-training","sentiment tasks"],"material":null,"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.566","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.1734","main.2491","main.247","main.16","main.2793"],"title":"Train No Evil: Selective Masking for Task-Guided Pre-Training","tldr":"Recently, pre-trained language models mostly follow the pre-train-then-fine-tuning paradigm and have achieved great performance on various downstream tasks. However, since the pre-training stage is typically task-agnostic and the fine-tuning stage us...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1299","id":"main.1299","presentation_id":"38938884"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1550.png","content":{"abstract":"Most of the existing pre-trained language representation models neglect to consider the linguistic knowledge of texts, which can promote language understanding in NLP tasks. To benefit the downstream tasks in sentiment analysis, we propose a novel language representation model called SentiLARE, which introduces word-level linguistic knowledge including part-of-speech tag and sentiment polarity (inferred from SentiWordNet) into pre-trained models. We first propose a context-aware sentiment attention mechanism to acquire the sentiment polarity of each word with its part-of-speech tag by querying SentiWordNet. Then, we devise a new pre-training task called label-aware masked language model to construct knowledge-aware language representation. Experiments show that SentiLARE obtains new state-of-the-art performance on a variety of sentiment analysis tasks.","authors":["Pei Ke","Haozhe Ji","Siyang Liu","Xiaoyan Zhu","Minlie Huang"],"demo_url":"","keywords":["language understanding","language tasks","nlp tasks","sentiment analysis"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.567","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.3375","main.1675","main.1766","main.1289","main.1952"],"title":"SentiLARE: Sentiment-Aware Language Representation Learning with Linguistic Knowledge","tldr":"Most of the existing pre-trained language representation models neglect to consider the linguistic knowledge of texts, which can promote language understanding in NLP tasks. To benefit the downstream tasks in sentiment analysis, we propose a novel la...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1550","id":"main.1550","presentation_id":"38938931"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1603.png","content":{"abstract":"Emotions are an important element of human nature, often affecting the overall wellbeing of a person. Therefore, it is no surprise that the health domain is a valuable area of interest for emotion  detection, as it can provide medical staff  or caregivers with essential information about patients. However, progress on this task has been hampered  by  the  absence of large labeled datasets. To this end, we introduce CancerEmo, an emotion dataset created from an online  health community and annotated with eight fine-grained emotions. We perform a comprehensive analysis of these emotions and develop deep learning models on the newly created dataset. Our best BERT model achieves an average F1 of 71%, which we improve further using domain-specific pre-training.","authors":["Tiberiu Sosea","Cornelia Caragea"],"demo_url":"","keywords":["emotion","emotion detection","detection","canceremo"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.715","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.2261","main.392","main.376","main.3532","main.1322"],"title":"CancerEmo: A Dataset for Fine-Grained Emotion Detection","tldr":"Emotions are an important element of human nature, often affecting the overall wellbeing of a person. Therefore, it is no surprise that the health domain is a valuable area of interest for emotion  detection, as it can provide medical staff  or careg...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1603","id":"main.1603","presentation_id":"38938944"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1675.png","content":{"abstract":"Aspect-based sentiment analysis of review texts is of great value for understanding user feedback in a fine-grained manner. It has in general two sub-tasks: (i) extracting aspects from each review, and (ii) classifying aspect-based reviews by sentiment polarity. In this paper, we propose a weakly-supervised approach for aspect-based sentiment analysis, which uses only a few keywords describing each aspect/sentiment without using any labeled examples. Existing methods are either designed only for one of the sub-tasks, or are based on topic models that may contain overlapping concepts. We propose to first learn <sentiment, aspect> joint topic embeddings in the word embedding space by imposing regularizations to encourage topic distinctiveness, and then use neural models to generalize the word-level discriminative information by pre-training the classifiers with embedding-based predictions and self-training them on unlabeled data. Our comprehensive performance analysis shows that our method generates quality joint topics and outperforms the baselines significantly (7.4% and 5.1% F1-score gain on average for aspect and sentiment classification respectively) on benchmark datasets.","authors":["Jiaxin Huang","Yu Meng","Fang Guo","Heng Ji","Jiawei Han"],"demo_url":"","keywords":["extracting aspects","classifying reviews","aspect-based analysis","aspect classification"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.568","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.3286","main.3185","main.3064","main.1289","main.3375"],"title":"Weakly-Supervised Aspect-Based Sentiment Analysis via Joint Aspect-Sentiment Topic Embedding","tldr":"Aspect-based sentiment analysis of review texts is of great value for understanding user feedback in a fine-grained manner. It has in general two sub-tasks: (i) extracting aspects from each review, and (ii) classifying aspect-based reviews by sentime...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1675","id":"main.1675","presentation_id":"38938965"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1750.png","content":{"abstract":"Online debate forums provide users a platform to express their opinions on controversial topics while being exposed to opinions from diverse set of viewpoints. Existing work in Natural Language Processing (NLP) has shown that linguistic features extracted from the debate text and features encoding the characteristics of the audience are both critical in persuasion studies. In this paper, we aim to further investigate the role of discourse structure of the arguments from online debates in their persuasiveness. In particular, we use the factor graph model to obtain features for the argument structure of debates from an online debating platform and incorporate these features to an LSTM-based model to predict the debater that makes the most convincing arguments. We find that incorporating argument structure features play an essential role in achieving the best predictive performance in assessing the persuasiveness of the arguments on online debates.","authors":["Jialu Li","Esin Durmus","Claire Cardie"],"demo_url":"","keywords":["natural processing","nlp","persuasion studies","online debates"],"material":null,"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.716","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.2996","main.916","main.440","main.955","main.2688"],"title":"Exploring the Role of Argument Structure in Online Debate Persuasion","tldr":"Online debate forums provide users a platform to express their opinions on controversial topics while being exposed to opinions from diverse set of viewpoints. Existing work in Natural Language Processing (NLP) has shown that linguistic features extr...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1750","id":"main.1750","presentation_id":"38938980"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.1766.png","content":{"abstract":"The state-of-the-art methods in aspect-level sentiment classification have leveraged the graph based models to incorporate the syntactic structure of a sentence. While being effective, these methods ignore the corpus level word co-occurrence information, which reflect the collocations in linguistics like “nothing special”. Moreover, they do not distinguish the different types of syntactic dependency, e.g., a nominal subject relation “food-was” is treated equally as an adjectival complement relation “was-okay” in “food was okay”.  To tackle the above two limitations, we propose a novel architecture which convolutes over hierarchical syntactic and lexical graphs. Specifically, we employ a global lexical graph to encode the corpus level word co-occurrence information. Moreover, we build a concept hierarchy on both the syntactic and lexical graphs for differentiating various types of dependency relations or lexical word pairs. Finally, we design a bi-level interactive graph convolution network to fully exploit these two graphs. Extensive experiments on five bench- mark datasets show that our method outperforms the state-of-the-art baselines.","authors":["Mi Zhang","Tieyun Qian"],"demo_url":"","keywords":["aspect-level classification","graph models","bi-level network","syntactic structure"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.286","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.1289","main.3375","main.1675","main.1550","main.2363"],"title":"Convolution over Hierarchical Syntactic and Lexical Graphs for Aspect Level Sentiment Analysis","tldr":"The state-of-the-art methods in aspect-level sentiment classification have leveraged the graph based models to incorporate the syntactic structure of a sentence. While being effective, these methods ignore the corpus level word co-occurrence informat...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.1766","id":"main.1766","presentation_id":"38938983"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.2133.png","content":{"abstract":"Peer review and rebuttal, with rich interactions and argumentative discussions in between, are naturally a good resource to mine arguments. However, few works study both of them simultaneously. In this paper, we introduce a new argument pair extraction (APE) task on peer review and rebuttal in order to study the contents, the structure and the connections between them. We prepare a challenging dataset that contains 4,764 fully annotated review-rebuttal passage pairs from an open review platform to facilitate the study of this task. To automatically detect argumentative propositions and extract argument pairs from this corpus, we cast it as the combination of a sequence labeling task and a text relation classification task. Thus, we propose a multitask learning framework based on hierarchical LSTM networks. Extensive experiments and analysis demonstrate the effectiveness of our multi-task framework, and also show the challenges of the new task as well as motivate future research directions.","authors":["Liying Cheng","Lidong Bing","Qian Yu","Wei Lu","Luo Si"],"demo_url":"","keywords":["peer review","argument task","sequence task","text task"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.569","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.471","main.1159","main.2688","main.2476","main.574"],"title":"APE: Argument Pair Extraction from Peer Review and Rebuttal via Multi-task Learning","tldr":"Peer review and rebuttal, with rich interactions and argumentative discussions in between, are naturally a good resource to mine arguments. However, few works study both of them simultaneously. In this paper, we introduce a new argument pair extracti...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.2133","id":"main.2133","presentation_id":"38939058"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.2549.png","content":{"abstract":"Prior research has recognized the need to associate affective polarities with events and has produced several techniques and lexical resources for identifying affective events. Our research introduces new classification models to assign affective polarity to event phrases. First, we present a BERT-based model for affective event classification and show that the classifier achieves substantially better performance than a large affective event knowledge base. Second, we present a  discourse-enhanced self-training method that iteratively improves the classifier with unlabeled data. The key idea is to exploit event phrases that occur with a coreferent sentiment expression.  The discourse-enhanced self-training algorithm iteratively labels new event phrases based on both the classifier's predictions and the polarities of the event's coreferent sentiment expressions.  Our results show that discourse-enhanced self-training further improves both recall and precision for affective event classification.","authors":["Yuan Zhuang","Tianyu Jiang","Ellen Riloff"],"demo_url":"","keywords":["affective classification","classification models","bert-based model","classifier"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.452","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 01:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z9C","start_time":"Wed, 18 Nov 2020 00:00:00 GMT"}],"similar_paper_uids":["main.1675","main.1550","main.1611","main.1654","main.3329"],"title":"Affective Event Classification with Discourse-enhanced Self-training","tldr":"Prior research has recognized the need to associate affective polarities with events and has produced several techniques and lexical resources for identifying affective events. Our research introduces new classification models to assign affective pol...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.2549","id":"main.2549","presentation_id":"38939141"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.2688.png","content":{"abstract":"When summarizing a collection of views, arguments or opinions on some topic, it is often desirable not only to extract the most salient points, but also to quantify their prevalence. Work on multi-document summarization has traditionally focused on creating textual summaries, which lack this quantitative aspect. Recent work has proposed to summarize arguments by mapping them to a small set of expert-generated key points, where the salience of each key point corresponds to the number of its matching arguments. The current work advances key point analysis in two important respects: first, we develop a method for automatic extraction of key points, which enables fully automatic analysis, and is shown to achieve performance comparable to a human expert. Second, we demonstrate that the applicability of key point analysis goes well beyond argumentation data. Using models trained on publicly available argumentation datasets, we achieve promising results in two additional domains: municipal surveys and user reviews. An additional contribution is an in-depth evaluation of argument-to-key point matching models, where we substantially outperform previous results.","authors":["Roy Bar-Haim","Yoav Kantor","Lilach Eden","Roni Friedman","Dan Lahav","Noam Slonim"],"demo_url":"","keywords":["multi-document summarization","key analysis","automatic points","automatic analysis"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.3","program":"main","sessions":[{"end_time":"Mon, 16 Nov 2020 17:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z1A","start_time":"Mon, 16 Nov 2020 16:00:00 GMT"}],"similar_paper_uids":["main.1023","main.3389","main.2506","main.965","main.1159"],"title":"Quantitative argument summarization and beyond: Cross-domain key point analysis","tldr":"When summarizing a collection of views, arguments or opinions on some topic, it is often desirable not only to extract the most salient points, but also to quantify their prevalence. Work on multi-document summarization has traditionally focused on c...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.2688","id":"main.2688","presentation_id":"38939172"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.2712.png","content":{"abstract":"Stance detection is an important component of understanding hidden influences in everyday life. Since there are thousands of potential topics to take a stance on, most with little to no training data, we focus on zero-shot stance detection: classifying stance from no training examples. In this paper, we present a new dataset for zero-shot stance detection that captures a wider range of topics and lexical variation than in previous datasets. Additionally, we propose a new model for stance detection that implicitly captures relationships between topics using generalized topic representations and show that this model improves performance on a number of challenging linguistic phenomena.","authors":["Emily Allaway","Kathleen McKeown"],"demo_url":"","keywords":["stance detection","zero-shot detection","classifying stance","linguistic phenomena"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.717","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.1952","main.2792","main.2996","main.30","main.1287"],"title":"Zero-Shot Stance Detection: A Dataset and Model using Generalized Topic Representations","tldr":"Stance detection is an important component of understanding hidden influences in everyday life. Since there are thousands of potential topics to take a stance on, most with little to no training data, we focus on zero-shot stance detection: classifyi...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.2712","id":"main.2712","presentation_id":"38939177"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.2996.png","content":{"abstract":"Social media platforms have become an essential venue for online deliberation where users discuss arguments, debate, and form opinions. In this paper, we propose an unsupervised method to detect the stance of argumentative claims with respect to a topic. Most related work focuses on topic-specific supervised models that need to be trained for every emergent debate topic. To address this limitation, we propose a topic independent approach that focuses on a frequently encountered class of arguments, specifically, on arguments from consequences. We do this by extracting the effects that claims refer to, and proposing a means for inferring if the effect is a good or bad consequence. Our experiments provide promising results that are comparable to, and in particular regards even outperform BERT. Furthermore, we publish a novel dataset of arguments relating to consequences, annotated with Amazon Mechanical Turk.","authors":["Jonathan Kobbe","Ioana Hulpus","Heiner Stuckenschmidt"],"demo_url":"","keywords":["online deliberation","stance claims","unsupervised method","topic-specific models"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.4","program":"main","sessions":[{"end_time":"Mon, 16 Nov 2020 17:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z1A","start_time":"Mon, 16 Nov 2020 16:00:00 GMT"}],"similar_paper_uids":["main.1750","main.2688","main.1287","main.789","main.2712"],"title":"Unsupervised stance detection for arguments from consequences","tldr":"Social media platforms have become an essential venue for online deliberation where users discuss arguments, debate, and form opinions. In this paper, we propose an unsupervised method to detect the stance of argumentative claims with respect to a to...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.2996","id":"main.2996","presentation_id":"38939246"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3023.png","content":{"abstract":"Adapting pre-trained language models (PrLMs) (e.g., BERT) to new domains has gained much attention recently. Instead of fine-tuning PrLMs as done in most previous work, we investigate how to adapt the features of PrLMs to new domains without fine-tuning. We explore unsupervised domain adaptation (UDA) in this paper. With the features from PrLMs, we adapt the models trained with labeled data from the source domain to the unlabeled target domain. Self-training is widely used for UDA, and it predicts pseudo labels on the target domain data for training. However, the predicted pseudo labels inevitably include noise, which will negatively affect training a robust model. To improve the robustness of self-training, in this paper we present class-aware feature self-distillation (CFd) to learn discriminative features from PrLMs, in which PrLM features are self-distilled into a feature adaptation module and the features from the same class are more tightly clustered. We further extend CFd to a cross-language setting, in which language discrepancy is studied. Experiments on two monolingual and multilingual Amazon review datasets show that CFd can consistently improve the performance of self-training in cross-domain and cross-language settings.","authors":["Hai Ye","Qingyu Tan","Ruidan He","Juntao Li","Hwee Tou Ng","Lidong Bing"],"demo_url":"","keywords":["unsupervised adaptation","self-training","pre-trained models","bert"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.599","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 10:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z12D","start_time":"Wed, 18 Nov 2020 09:00:00 GMT"}],"similar_paper_uids":["main.16","main.2893","main.852","main.2491","main.1631"],"title":"Feature Adaptation of Pre-Trained Language Models across Languages and Domains with Robust Self-Training","tldr":"Adapting pre-trained language models (PrLMs) (e.g., BERT) to new domains has gained much attention recently. Instead of fine-tuning PrLMs as done in most previous work, we investigate how to adapt the features of PrLMs to new domains without fine-tun...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3023","id":"main.3023","presentation_id":"38939252"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3064.png","content":{"abstract":"Neural Document-level Multi-aspect Sentiment Classification (DMSC) usually requires a lot of manual aspect-level sentiment annotations, which is time-consuming and laborious. As document-level sentiment labeled data are widely available from online service, it is valuable to perform DMSC with such free document-level annotations. To this end, we propose a novel Diversified Multiple Instance Learning Network (D-MILN), which is able to achieve aspect-level sentiment classification with only document-level weak supervision. Specifically, we connect aspect-level and document-level sentiment by formulating this problem as multiple instance learning, providing a way to learn aspect-level classifier from the back propagation of document-level supervision. Two diversified regularizations are further introduced in order to avoid the overfitting on document-level signals during training. Diversified textual regularization encourages the classifier to select aspect-relevant snippets, and diversified sentimental regularization prevents the aspect-level sentiments from being overly consistent with document-level sentiment. Experimental results on TripAdvisor and BeerAdvocate datasets show that D-MILN remarkably outperforms recent weakly-supervised baselines, and is also comparable to the supervised method.","authors":["Yunjie Ji","Hao Liu","Bolei He","Xinyan Xiao","Hua Wu","Yanhua Yu"],"demo_url":"","keywords":["neural","aspect-level classification","dmsc","diversified"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.570","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.1675","main.3185","main.3286","main.1289","main.1023"],"title":"Diversified Multiple Instance Learning for Document-Level Multi-Aspect Sentiment Classification","tldr":"Neural Document-level Multi-aspect Sentiment Classification (DMSC) usually requires a lot of manual aspect-level sentiment annotations, which is time-consuming and laborious. As document-level sentiment labeled data are widely available from online s...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3064","id":"main.3064","presentation_id":"38939261"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3185.png","content":{"abstract":"Aspect-category sentiment analysis (ACSA) aims to predict sentiment polarities of sentences with respect to given aspect categories. To detect the sentiment toward a particular aspect category in a sentence, most previous methods first generate an aspect category-specific sentence representation for the aspect category, then predict the sentiment polarity based on the representation. These methods ignore the fact that the sentiment of an aspect category mentioned in a sentence is an aggregation of the sentiments of the words indicating the aspect category in the sentence, which leads to suboptimal performance. In this paper, we propose a Multi-Instance Multi-Label Learning Network for Aspect-Category sentiment analysis (AC-MIMLLN), which treats sentences as bags, words as instances, and the words indicating an aspect category as the key instances of the aspect category. Given a sentence and the aspect categories mentioned in the sentence, AC-MIMLLN first predicts the sentiments of the instances, then finds the key instances for the aspect categories, finally obtains the sentiments of the sentence toward the aspect categories by aggregating the key instance sentiments. Experimental results on three public datasets demonstrate the effectiveness of AC-MIMLLN.","authors":["Yuncong Li","Cunxiang Yin","Sheng-hua Zhong","Xu Pan"],"demo_url":"","keywords":["aspect-category analysis","aspect-category","acsa","aspect representation"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.287","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.1675","main.3064","main.3286","main.1217","main.1289"],"title":"Multi-Instance Multi-Label Learning Networks for Aspect-Category Sentiment Analysis","tldr":"Aspect-category sentiment analysis (ACSA) aims to predict sentiment polarities of sentences with respect to given aspect categories. To detect the sentiment toward a particular aspect category in a sentence, most previous methods first generate an as...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3185","id":"main.3185","presentation_id":"38939284"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3286.png","content":{"abstract":"Aspect based sentiment analysis, predicting sentiment polarity of given aspects, has drawn extensive attention. Previous attention-based models emphasize using aspect semantics to help extract opinion features for classification. However, these works are either not able to capture opinion spans as a whole, or not able to capture variable-length opinion spans. In this paper, we present a neat and effective structured attention model by aggregating multiple linear-chain CRFs. Such a design allows the model to extract aspect-specific opinion spans and then evaluate sentiment polarity by exploiting the extracted opinion features. The experimental results on four datasets demonstrate the effectiveness of the proposed model, and our analysis demonstrates that our model can capture aspect-specific opinion spans.","authors":["Lu Xu","Lidong Bing","Wei Lu","Fei Huang"],"demo_url":"","keywords":["predicting polarity","classification","aspect analysis","attention-based models"],"material":null,"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.288","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.1675","main.1289","main.3185","main.3375","main.3282"],"title":"Aspect Sentiment Classification with Aspect-Specific Opinion Spans","tldr":"Aspect based sentiment analysis, predicting sentiment polarity of given aspects, has drawn extensive attention. Previous attention-based models emphasize using aspect semantics to help extract opinion features for classification. However, these works...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3286","id":"main.3286","presentation_id":"38939301"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3329.png","content":{"abstract":"The task of emotion-cause pair extraction deals with finding all emotions and the corresponding causes in unannotated emotion texts. Most recent studies are based on the likelihood of Cartesian product among all clause candidates, resulting in a high computational cost. Targeting this issue, we regard the task as a sequence labeling problem and propose a novel tagging scheme with coding the distance between linked components into the tags, so that emotions and the corresponding causes can be extracted simultaneously. Accordingly, an end-to-end model is presented to process the input texts from left to right, always with linear time complexity, leading to a speed up. Experimental results show that our proposed model achieves the best performance, outperforming the state-of-the-art method by 2.26% (p<0.001) in F1 measure.","authors":["Chaofa Yuan","Chuang Fan","Jianzhu Bao","Ruifeng Xu"],"demo_url":"","keywords":["emotion-cause extraction","sequence problem","tagging scheme","linked components"],"material":null,"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.289","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.3594","main.2261","main.548","main.983","main.3282"],"title":"Emotion-Cause Pair Extraction as Sequence Labeling Based on A Novel Tagging Scheme","tldr":"The task of emotion-cause pair extraction deals with finding all emotions and the corresponding causes in unannotated emotion texts. Most recent studies are based on the likelihood of Cartesian product among all clause candidates, resulting in a high...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3329","id":"main.3329","presentation_id":"38939311"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3357.png","content":{"abstract":"Sentiment classification on tweets often needs to deal with the problems of under-specificity, noise, and multilingual content. This study proposes a heterogeneous multi-layer network-based representation of tweets to generate multiple representations of a tweet and address the above issues. The generated representations are further ensembled and classified using a neural-based early fusion approach. Further, we propose a centrality aware random-walk for node embedding and tweet representations suitable for the multi-layer network. From various experimental analysis, it is evident that the proposed method can address the problem of under-specificity, noisy text, and multilingual content present in a tweet and provides better classification performance than the text-based counterparts. Further, the proposed centrality aware based random walk provides better representations than unbiased and other biased counterparts.","authors":["Loitongbam Gyanendro Singh","Anasua Mitra","Sanasam Ranbir Singh"],"demo_url":"","keywords":["sentiment classification","multiple tweet","node embedding","classification"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.718","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.1675","main.1766","main.1289","main.789","main.1287"],"title":"Sentiment Analysis of Tweets using Heterogeneous Multi-layer Network Representation and Embedding","tldr":"Sentiment classification on tweets often needs to deal with the problems of under-specificity, noise, and multilingual content. This study proposes a heterogeneous multi-layer network-based representation of tweets to generate multiple representation...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3357","id":"main.3357","presentation_id":"38939318"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3375.png","content":{"abstract":"Targeted opinion word extraction (TOWE) is a sub-task of aspect based sentiment analysis (ABSA) which aims to find the opinion words for a given aspect-term in a sentence. Despite their success for TOWE, the current deep learning models fail to exploit the syntactic information of the sentences that have been proved to be useful for TOWE in the prior research. In this work, we propose to incorporate the syntactic structures of the sentences into the deep learning models for TOWE, leveraging the syntax-based opinion possibility scores and the syntactic connections between the words. We also introduce a novel regularization technique to improve the performance of the deep learning models based on the representation distinctions between the words in TOWE. The proposed model is extensively analyzed and achieves the state-of-the-art performance on four benchmark datasets.","authors":["Amir Pouran Ben Veyseh","Nasim Nouri","Franck Dernoncourt","Dejing Dou","Thien Huu Nguyen"],"demo_url":"","keywords":["towe","aspect analysis","absa","deep models"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.719","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.1289","main.1550","main.1675","main.1766","main.983"],"title":"Introducing Syntactic Structures into Target Opinion Word Extraction with Deep Learning","tldr":"Targeted opinion word extraction (TOWE) is a sub-task of aspect based sentiment analysis (ABSA) which aims to find the opinion words for a given aspect-term in a sentence. Despite their success for TOWE, the current deep learning models fail to explo...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3375","id":"main.3375","presentation_id":"38939322"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3454.png","content":{"abstract":"While hyperbole is one of the most prevalent rhetorical devices, it is arguably one of the least studied devices in the figurative language processing community. We contribute to the study of hyperbole by (1) creating a corpus focusing on sentence-level hyperbole detection,  (2) performing a statistical and manual analysis of our corpus, and (3) addressing the automatic hyperbole detection task.","authors":["Li Kong","Chuanyi Li","Jidong Ge","Bin Luo","Vincent Ng"],"demo_url":"","keywords":["figurative community","sentence-level detection","automatic task","hyperbole"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.571","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.2766","main.2452","main.868","main.1455","main.3593"],"title":"Identifying Exaggerated Language","tldr":"While hyperbole is one of the most prevalent rhetorical devices, it is arguably one of the least studied devices in the figurative language processing community. We contribute to the study of hyperbole by (1) creating a corpus focusing on sentence-le...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3454","id":"main.3454","presentation_id":"38939340"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3462.png","content":{"abstract":"Though deep learning has achieved significant success in various NLP tasks, most deep learning models lack the capability of encoding explicit domain knowledge to model complex causal relationships among different types of variables. On the other hand, logic rules offer a compact expression to represent the causal relationships to guide the training process. Logic programs can be cast as a satisfiability problem which aims to find truth assignments to logic variables by maximizing the number of satisfiable clauses (MaxSAT). We adopt the MaxSAT semantics to model logic inference process and smoothly incorporate a weighted version of MaxSAT that connects deep neural networks and a graphical model in a joint framework. The joint model feeds deep learning outputs to a weighted MaxSAT layer to rectify the erroneous predictions and can be trained via end-to-end gradient descent. Our proposed model associates the benefits of high-level feature learning, knowledge reasoning, and structured learning with observable performance gain for the task of aspect-based opinion extraction.","authors":["Meixi Wu","Wenya Wang","Sinno Jialin Pan"],"demo_url":"","keywords":["nlp tasks","training process","logic programs","satisfiability problem"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.453","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 01:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z9C","start_time":"Wed, 18 Nov 2020 00:00:00 GMT"}],"similar_paper_uids":["main.3375","main.2972","main.2426","main.471","main.16"],"title":"Deep Weighted MaxSAT for Aspect-based Opinion Extraction","tldr":"Though deep learning has achieved significant success in various NLP tasks, most deep learning models lack the capability of encoding explicit domain knowledge to model complex causal relationships among different types of variables. On the other han...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3462","id":"main.3462","presentation_id":"38939342"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3579.png","content":{"abstract":"The supervised models for aspect-based sentiment analysis (ABSA) rely heavily on labeled data. However, fine-grained labeled data are scarce for the ABSA task. To alleviate the dependence on labeled data, prior works mainly focused on feature-based adaptation, which used the domain-shared knowledge to construct auxiliary tasks or domain adversarial learning to bridge the gap between domains, while ignored the attribute of instance-based adaptation. To resolve this limitation, we propose an end-to-end framework to jointly perform feature and instance based adaptation for the ABSA task in this paper. Based on BERT, we learn domain-invariant feature representations by using part-of-speech features and syntactic dependency relations to construct auxiliary tasks, and jointly perform word-level instance weighting in the framework of sequence labeling. Experiment results on four benchmarks show that the proposed method can achieve significant improvements in comparison with the state-of-the-arts in both tasks of cross-domain End2End ABSA and cross-domain aspect extraction.","authors":["Chenggong Gong","Jianfei Yu","Rui Xia"],"demo_url":"","keywords":["aspect-based analysis","absa task","feature-based adaptation","auxiliary tasks"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.572","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 04:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g4E","start_time":"Wed, 18 Nov 2020 02:00:00 GMT"}],"similar_paper_uids":["main.1217","main.1675","TACL.2255","main.3013","main.471"],"title":"Unified Feature and Instance Based Domain Adaptation for Aspect-Based Sentiment Analysis","tldr":"The supervised models for aspect-based sentiment analysis (ABSA) rely heavily on labeled data. However, fine-grained labeled data are scarce for the ABSA task. To alleviate the dependence on labeled data, prior works mainly focused on feature-based a...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3579","id":"main.3579","presentation_id":"38939369"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.3594.png","content":{"abstract":"Emotion-cause pair extraction (ECPE) is a new task that aims to extract the potential pairs of emotions and their corresponding causes in a document. The existing methods first perform emotion extraction and cause extraction independently, and then perform emotion-cause pairing and filtering. However, the above methods ignore the fact that the cause and the emotion it triggers are inseparable, and the extraction of the cause without specifying the emotion is pathological, which greatly limits the performance of the above methods in the first step. To tackle these shortcomings, we propose two joint frameworks for ECPE: 1) multi-label learning for the extraction of the cause clauses corresponding to the specified emotion clause (CMLL) and 2) multi-label learning for the extraction of the emotion clauses corresponding to the specified cause clause (EMLL). The window of multi-label learning is centered on the specified emotion clause or cause clause and slides as their positions move. Finally, CMLL and EMLL are integrated to obtain the final result. We evaluate our model on a benchmark emotion cause corpus, the results show that our approach achieves the best performance among all compared systems on the ECPE task.","authors":["Zixiang Ding","Rui Xia","Jianfei Yu"],"demo_url":"","keywords":["emotion-cause extraction","emotion extraction","emotion-cause filtering","ecpe"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.290","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.3329","main.2261","main.3579","main.392","main.548"],"title":"End-to-End Emotion-Cause Pair Extraction based on Sliding Window Multi-Label Learning","tldr":"Emotion-cause pair extraction (ECPE) is a new task that aims to extract the potential pairs of emotions and their corresponding causes in a document. The existing methods first perform emotion extraction and cause extraction independently, and then p...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.3594","id":"main.3594","presentation_id":"38939373"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.384.png","content":{"abstract":"Interest in emotion recognition in conversations (ERC) has been increasing in various fields, because it can be used to analyze user behaviors and detect fake news. Many recent ERC methods use graph-based neural networks to take the relationships between the utterances of the speakers into account. In particular, the state-of-the-art method considers self- and inter-speaker dependencies in conversations by using relational graph attention networks (RGAT). However, graph-based neural networks do not take sequential information into account. In this paper, we propose relational position encodings that provide RGAT with sequential information reflecting the relational graph structure. Accordingly, our RGAT model can capture both the speaker dependency and the sequential information. Experiments on four ERC datasets show that our model is beneficial to recognizing emotions expressed in conversations. In addition, our approach empirically outperforms the state-of-the-art on all of the benchmark datasets.","authors":["Taichi Ishiwatari","Yuki Yasuda","Taro Miyazaki","Jun Goto"],"demo_url":"","keywords":["emotion recognition","recognizing emotions","erc","erc methods"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.597","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 10:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z12D","start_time":"Wed, 18 Nov 2020 09:00:00 GMT"}],"similar_paper_uids":["main.1287","main.916","main.2261","main.3532","main.782"],"title":"Relation-aware Graph Attention Networks with Relational Position Encodings for Emotion Recognition in Conversations","tldr":"Interest in emotion recognition in conversations (ERC) has been increasing in various fields, because it can be used to analyze user behaviors and detect fake news. Many recent ERC methods use graph-based neural networks to take the relationships bet...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.384","id":"main.384","presentation_id":"38938698"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.392.png","content":{"abstract":"As an important research issue in the natural language processing community, multi-label emotion detection has been drawing more and more attention in the last few years. However, almost all existing studies focus on one modality (e.g., textual modality). In this paper, we focus on multi-label emotion detection in a multi-modal scenario. In this scenario, we need to consider both the dependence among different labels (label dependence) and the dependence between each predicting label and different modalities (modality dependence). Particularly, we propose a multi-modal sequence-to-set approach to effectively model both kinds of dependence in multi-modal multi-label emotion detection. The detailed evaluation demonstrates the effectiveness of our approach.","authors":["Dong Zhang","Xincheng Ju","Junhui Li","Shoushan Li","Qiaoming Zhu","Guodong Zhou"],"demo_url":"","keywords":["natural community","multi-label detection","multi-modal detection","multi-modal approach"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.291","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.2261","main.3329","main.376","main.3594","main.1603"],"title":"Multi-modal Multi-label Emotion Detection with Modality and Label Dependence","tldr":"As an important research issue in the natural language processing community, multi-label emotion detection has been drawing more and more attention in the last few years. However, almost all existing studies focus on one modality (e.g., textual modal...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.392","id":"main.392","presentation_id":"38938701"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.438.png","content":{"abstract":"Finding attackable sentences in an argument is the first step toward successful refutation in argumentation. We present a first large-scale analysis of sentence attackability in online arguments. We analyze driving reasons for attacks in argumentation and identify relevant characteristics of sentences. We demonstrate that a sentence's attackability is associated with many of these characteristics regarding the sentence's content, proposition types, and tone, and that an external knowledge source can provide useful information about attackability. Building on these findings, we demonstrate that machine learning models can automatically detect attackable sentences in arguments, significantly better than several baselines and comparably well to laypeople.","authors":["Yohan Jo","Seojin Bang","Emaad Manzoor","Eduard Hovy","Chris Reed"],"demo_url":"","keywords":["refutation argumentation","argumentation","large-scale analysis","sentence attackability"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.1","program":"main","sessions":[{"end_time":"Mon, 16 Nov 2020 17:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z1A","start_time":"Mon, 16 Nov 2020 16:00:00 GMT"}],"similar_paper_uids":["main.440","main.96","main.2416","main.3495","main.2895"],"title":"Detecting Attackable Sentences in Arguments","tldr":"Finding attackable sentences in an argument is the first step toward successful refutation in argumentation. We present a first large-scale analysis of sentence attackability in online arguments. We analyze driving reasons for attacks in argumentatio...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.438","id":"main.438","presentation_id":"38938707"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.440.png","content":{"abstract":"Argumentation accommodates various rhetorical devices, such as questions, reported speech, and imperatives. These rhetorical tools usually assert argumentatively relevant propositions rather implicitly, so understanding their true meaning is key to understanding certain arguments properly. However, most argument mining systems and computational linguistics research have paid little attention to implicitly asserted propositions in argumentation. In this paper, we examine a wide range of computational methods for extracting propositions that are implicitly asserted in questions, reported speech, and imperatives in argumentation. By evaluating the models on a corpus of 2016 U.S. presidential debates and online commentary, we demonstrate the effectiveness and limitations of the computational models. Our study may inform future research on argument mining and the semantics of these rhetorical devices in argumentation.","authors":["Yohan Jo","Jacky Visser","Chris Reed","Eduard Hovy"],"demo_url":"","keywords":["argumentation","imperatives argumentation","argument mining","rhetorical tools"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.2","program":"main","sessions":[{"end_time":"Mon, 16 Nov 2020 17:00:00 GMT","hosts":null,"link":"https://zoom.us","session_name":"z1A","start_time":"Mon, 16 Nov 2020 16:00:00 GMT"}],"similar_paper_uids":["main.1750","main.438","main.2996","main.955","main.868"],"title":"Extracting Implicitly Asserted Propositions in Argumentation","tldr":"Argumentation accommodates various rhetorical devices, such as questions, reported speech, and imperatives. These rhetorical tools usually assert argumentatively relevant propositions rather implicitly, so understanding their true meaning is key to u...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.440","id":"main.440","presentation_id":"38938708"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.476.png","content":{"abstract":"Current approaches to empathetic response generation view the set of emotions expressed in the input text as a flat structure, where all the emotions are treated uniformly. We argue that empathetic responses often mimic the emotion of the user to a varying degree, depending on its positivity or negativity and content. We show that the consideration of these polarity-based emotion clusters and emotional mimicry results in improved empathy and contextual relevance of the response as compared to the state-of-the-art. Also, we introduce stochasticity into the emotion mixture that yields emotionally more varied empathetic responses than the previous work. We demonstrate the importance of these factors to empathetic response generation using both automatic- and human-based evaluations. The implementation of MIME is publicly available at https://github.com/declare-lab/MIME.","authors":["Navonil Majumder","Pengfei Hong","Shanshan Peng","Jiankun Lu","Deepanway Ghosal","Alexander Gelbukh","Rada Mihalcea","Soujanya Poria"],"demo_url":"","keywords":["empathetic generation","emotion mixture","automatic- evaluations","mime"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.721","program":"main","sessions":[{"end_time":"Wed, 18 Nov 2020 20:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g5E","start_time":"Wed, 18 Nov 2020 18:00:00 GMT"}],"similar_paper_uids":["main.165","main.3028","main.3532","main.2561","main.2707"],"title":"MIME: MIMicking Emotions for Empathetic Response Generation","tldr":"Current approaches to empathetic response generation view the set of emotions expressed in the input text as a flat structure, where all the emotions are treated uniformly. We argue that empathetic responses often mimic the emotion of the user to a v...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.476","id":"main.476","presentation_id":"38938717"},{"card_image_path":"https://emnlp2020-public.s3.amazonaws.com/paper_images/main.733.png","content":{"abstract":"Aspect-based sentiment analysis (ABSA) aims to predict the sentiment towards a specific aspect in the text. However, existing ABSA test sets cannot be used to probe whether a model can distinguish the sentiment of the target aspect from the non-target aspects. To solve this problem, we develop a simple but effective approach to enrich ABSA test sets. Specifically, we generate new examples to disentangle the confounding sentiments of the non-target aspects from the target aspect's sentiment. Based on the SemEval 2014 dataset, we construct the Aspect Robustness Test Set (ARTS) as a comprehensive probe of the aspect robustness of ABSA models. Over 92% data of ARTS show high fluency and desired sentiment on all aspects by human evaluation. Using ARTS, we analyze the robustness of nine ABSA models, and observe, surprisingly, that their accuracy drops by up to 69.73%. We explore several ways to improve aspect robustness, and find that adversarial training can improve models' performance on ARTS by up to 32.85%. Our code and new test set are available at https://github.com/zhijing-jin/ARTS_TestSet","authors":["Xiaoyu Xing","Zhijing Jin","Di Jin","Bingning Wang","Qi Zhang","Xuanjing Huang"],"demo_url":"","keywords":["aspect-based analysis","absa","absa models","arts"],"material":null,"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.emnlp-main.292","program":"main","sessions":[{"end_time":"Tue, 17 Nov 2020 12:00:00 GMT","hosts":null,"link":"https://www.virtualchair.net/events/emnlp2020","session_name":"g2H","start_time":"Tue, 17 Nov 2020 10:00:00 GMT"}],"similar_paper_uids":["main.1675","main.2784","main.3286","main.789","main.3579"],"title":"Tasty Burgers, Soggy Fries: Probing Aspect Robustness in Aspect-Based Sentiment Analysis","tldr":"Aspect-based sentiment analysis (ABSA) aims to predict the sentiment towards a specific aspect in the text. However, existing ABSA test sets cannot be used to probe whether a model can distinguish the sentiment of the target aspect from the non-targe...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.733","id":"main.733","presentation_id":"38938764"}]
